wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_endat.h
/* EDIM_TFMT register offset */
#define EDIM_ENDAT_STAT_REG_OFFSET           ((uint32_t)0x0000001CU)                          /*!< EDIM_ENDAT STAT register offset */
#define EDIM_ENDAT_INTEN_REG_OFFSET          ((uint32_t)0x00000020U)                          /*!< EDIM_ENDAT INTEN register offset */

/* EDIM_ENDAT interrupt flag */
typedef enum {
    EDIM_ENDAT_INT_FLAG_RDATAUP  = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 0U, EDIM_ENDAT_STAT_REG_OFFSET, 0U),    /*!< EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update interrupt flag */
    EDIM_ENDAT_INT_FLAG_ERR1     = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 1U, EDIM_ENDAT_STAT_REG_OFFSET, 1U),    /*!< error message 1 interrupt flag */
    EDIM_ENDAT_INT_FLAG_CRC      = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 2U, EDIM_ENDAT_STAT_REG_OFFSET, 2U),    /*!< CRC error for received data interrupt flag */
    EDIM_ENDAT_INT_FLAG_TYPE1    = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 3U, EDIM_ENDAT_STAT_REG_OFFSET, 3U),    /*!< type I error interrupt flag */
    EDIM_ENDAT_INT_FLAG_TYPE2    = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 4U, EDIM_ENDAT_STAT_REG_OFFSET, 4U),    /*!< type II error interrupt flag */
    EDIM_ENDAT_INT_FLAG_MRSADDR  = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 5U, EDIM_ENDAT_STAT_REG_OFFSET, 5U),    /*!< MRS code or address  error interupt enable*/
    EDIM_ENDAT_INT_FLAG_RDATA2UP = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 8U, EDIM_ENDAT_STAT_REG_OFFSET, 8U),    /*!< EDIM_ENDAT_RDATA2 registers update interrupt flag */
    EDIM_ENDAT_INT_FLAG_RDATA3UP = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 9U, EDIM_ENDAT_STAT_REG_OFFSET, 9U),    /*!< EDIM_ENDAT_RDATA3 registers update interrupt flag */
    EDIM_ENDAT_INT_FLAG_ERR2     = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 10U, EDIM_ENDAT_STAT_REG_OFFSET, 10U),  /*!< error message 2 interrupt flag */
    EDIM_ENDAT_INT_FLAG_CRCADD1  = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 11U, EDIM_ENDAT_STAT_REG_OFFSET, 11U),  /*!< CRC error for addtional information 1 interrupt flag */
    EDIM_ENDAT_INT_FLAG_CRCADD2  = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 12U, EDIM_ENDAT_STAT_REG_OFFSET, 12U),  /*!< CRC error for addtional information 2 interrupt flag */
    EDIM_ENDAT_INT_FLAG_BUSY     = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 13U, EDIM_ENDAT_STAT_REG_OFFSET, 13U),  /*!< BUSY bit in EnDat protocol set interrupt flag */
    EDIM_ENDAT_INT_FLAG_RM       = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 14U, EDIM_ENDAT_STAT_REG_OFFSET, 14U),  /*!< RM bit in EnDat protocol set interrupt flag */
    EDIM_ENDAT_INT_FLAG_WRN      = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 15U, EDIM_ENDAT_STAT_REG_OFFSET, 15U),  /*!< WRN bit in EnDat protocol set interrupt flag */
    EDIM_ENDAT_INT_FLAG_SPIKE    = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 16U, EDIM_ENDAT_STAT_REG_OFFSET, 16U),  /*!< spike detection interrupt flag */
    EDIM_ENDAT_INT_FLAG_TO       = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 17U, EDIM_ENDAT_STAT_REG_OFFSET, 17U),  /*!< frame transmission timeout interrupt flag */
    EDIM_ENDAT_INT_FLAG_TYPE3    = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 18U, EDIM_ENDAT_STAT_REG_OFFSET, 18U),  /*!< type III error interrupt flag */
    EDIM_ENDAT_INT_FLAG_FIFOOVR  = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 24U, EDIM_ENDAT_STAT_REG_OFFSET, 24U),  /*!< dma overrun error interrupt flag */
    EDIM_ENDAT_INT_FLAG_FIFOUNR  = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 25U, EDIM_ENDAT_STAT_REG_OFFSET, 25U),  /*!< dma underrun error interrupt flag */
    EDIM_ENDAT_INT_FLAG_DMATO    = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 26U, EDIM_ENDAT_STAT_REG_OFFSET, 26U),  /*!< dma request timeout interrupt flag */
    EDIM_ENDAT_INT_FLAG_DATACHK  = EDIM_ENDAT_REGIDX_BIT2(EDIM_ENDAT_INTEN_REG_OFFSET, 31U, EDIM_ENDAT_STAT_REG_OFFSET, 31U),  /*!< all check have been performed and status is updated interrupt flag */
} edim_endat_interrupt_flag_enum;

/* EDIM_ENDAT flag */
#define EDIM_ENDAT_FLAG_MASK                ((uint32_t)0xC7C7FF3FU)
#define EDIM_ENDAT_FLAG_RDATAUP             EDIM_ENDAT_STAT_RDATAUPIF            /*!< EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update flag */
#define EDIM_ENDAT_FLAG_ERR1                EDIM_ENDAT_STAT_ERR1MIF              /*!< error message 1 flag */
#define EDIM_ENDAT_FLAG_CRC                 EDIM_ENDAT_STAT_CRCIF                /*!< CRC error for received data flag */
#define EDIM_ENDAT_FLAG_TYPE1               EDIM_ENDAT_STAT_TYPE1IF              /*!< type I error interrupt flag */
#define EDIM_ENDAT_FLAG_TYPE2               EDIM_ENDAT_STAT_TYPE2IF              /*!< type II error interrupt flag */
#define EDIM_ENDAT_FLAG_MRSADDR             EDIM_ENDAT_STAT_MRSADDRIF            /*!< MRS or address error interrupt flag */
#define EDIM_ENDAT_FLAG_RDATA2UP            EDIM_ENDAT_STAT_RDATA2UPIF           /*!< EDIM_ENDAT_RDATA2 registers update interrupt flag */
#define EDIM_ENDAT_FLAG_RDATA3UP            EDIM_ENDAT_STAT_RDATA3UPIF           /*!< EDIM_ENDAT_RDATA3 registers update interrupt flag */
#define EDIM_ENDAT_FLAG_ERR2                EDIM_ENDAT_STAT_ERR2MIF              /*!< error message 1 flag */
#define EDIM_ENDAT_FLAG_CRCADD1             EDIM_ENDAT_STAT_CRCADD1IF            /*!< CRC error for addtional information 1 flag */
#define EDIM_ENDAT_FLAG_CRCADD2             EDIM_ENDAT_STAT_CRCADD2IF            /*!< CRC error for addtional information 2 flag */
#define EDIM_ENDAT_FLAG_BUSY                EDIM_ENDAT_STAT_BUSYMIF              /*!< BUSY bit in EnDat protocol */
#define EDIM_ENDAT_FLAG_RM                  EDIM_ENDAT_STAT_RMMIF                /*!< RM bit in EnDat protocol */
#define EDIM_ENDAT_FLAG_WRN                 EDIM_ENDAT_STAT_WRNMIF               /*!< WRN bit in EnDat protocol */
#define EDIM_ENDAT_FLAG_SPIKE               EDIM_ENDAT_STAT_SPKIF                /*!< spike detection flag */
#define EDIM_ENDAT_FLAG_TO                  EDIM_ENDAT_STAT_TOIF                 /*!< frame transmission timeout flag */
#define EDIM_ENDAT_FLAG_TYPE3               EDIM_ENDAT_STAT_TYPE3IF              /*!< type III error interrupt flag */
#define EDIM_ENDAT_FLAG_DTC                 EDIM_ENDAT_STAT_DTCF                 /*!< propagation time compensation flag */
#define EDIM_ENDAT_FLAG_PTMC                EDIM_ENDAT_STAT_PTMCF                /*!< propagation time measurement complete flag */
#define EDIM_ENDAT_FLAG_FIFOOVR             EDIM_ENDAT_STAT_FIFOOVRIF            /*!< dma overrun error flag */
#define EDIM_ENDAT_FLAG_FIFOUNR             EDIM_ENDAT_STAT_FIFOUNRIF            /*!< dma underrun error flag */
#define EDIM_ENDAT_FLAG_DMATO               EDIM_ENDAT_STAT_DMATOIF              /*!< dma request timeout flag */
#define EDIM_ENDAT_FLAG_NEXTRDY             EDIM_ENDAT_STAT_NEXTRDYF             /*!< next transmission ready flag */
#define EDIM_ENDAT_FLAG_DATACHK             EDIM_ENDAT_STAT_DATACHKIF            /*!< all check have been performed and status is updated flag */

/* constants definitions */
/* EnDat  parameter struct definitions */
typedef struct
{   
    uint32_t clk_rate;                                                      /*!< configure transmission clock rate */
    uint32_t recovery_time;                                                 /*!< configure recovery time III */
    uint32_t filter;                                                        /*!< configure digital filter cycle width */
    uint32_t watchdog_value;                                                /*!< configure timeout length */
}edim_endat_parameter_struct;

typedef struct
{   
    uint8_t crc;                                                            /*!< CRC value from addtional info */
    uint8_t mrs_addr;                                                       /*!< MRS code or address from addtional info */
    uint16_t data;                                                          /*!< data from addtional info */
}edim_endat_addtional_info_struct;

