wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_edim_endat.h
/* EDIM_ENDAT communication functions */
/* configure EnDat command */
void edim_endat_command(uint32_t mode, uint32_t mrs_addr, uint32_t para);
/* start a frame transmit by software */
void edim_endat_data_transmission_software_trigger(void);
/* reset all registers of EnDat by software */
void edim_endat_software_reset(void);
/* configure EnDat hardware trigger */
void edim_endat_hardware_trigger_config(EventStatus newstatus);
/* configure EnDat hardware trigger delay */
void edim_endat_hardware_trigger_delay_config(uint32_t delay);
/* configure EnDat internal timer trigger period */
void edim_endat_internal_timer_trigger_period_config(uint32_t period);
/* enable EnDat DMA */
void edim_endat_dma_enable(void);
/* disable EnDat DMA */
void edim_endat_dma_disable(void);
/* flush EnDat DMA FIFO */
void edim_endat_dma_flush(void);
/* select EnDat data to DMA FIFO */
void edim_endat_dma_select(uint32_t reg_selected);
/* read EnDat slave data with low 32bit */
uint32_t edim_endat_data_low_read(void);
/* read EnDat encoder data */
uint64_t edim_endat_data_read(void);
/* read EnDat CRC bit in the received data */
uint8_t edim_endat_crc_of_data_read(void);
/* read EnDat F1 bit in the received data */
uint8_t edim_endat_f1_of_data_read(void);
/* read EnDat inverse of F2 bit in the received data */
uint8_t edim_endat_inverse_f2_of_data_read(void);
/* read EnDat encoder data from additional information 1 */
uint16_t edim_endat_addtional_info_1_data_read(void);
/* read EnDat encoder data from additional information 2 */
uint16_t edim_endat_addtional_info_2_data_read(void);
/* initialize EDIM_ENDAT addtional information struct with a default value */
void edim_endat_addtional_info_struct_para_init(edim_endat_addtional_info_struct *initpara);
/* read entire EnDat encoder additional information 1 */
void edim_endat_addtional_info_1_read(edim_endat_addtional_info_struct* add_info);
/* read entire EnDat encoder additional information 2 */
void edim_endat_addtional_info_2_read(edim_endat_addtional_info_struct* add_info);

/* EnDat interrupt and flag */
/* enable the EnDat interrupt */
void edim_endat_interrupt_enable(uint32_t interrupt);
/* disable the EnDat interrupt */
void edim_endat_interrupt_disable(uint32_t interrupt);
/* get EnDat flag */
FlagStatus edim_endat_flag_get(uint32_t flag);
/* clear EnDat flag */
void edim_endat_flag_clear(uint32_t flag);
/* get EnDat interrupt flag */
FlagStatus edim_endat_interrupt_flag_get(edim_endat_interrupt_flag_enum int_flag);
/* clear EnDat interrupt flag */
void edim_endat_interrupt_flag_clear(edim_endat_interrupt_flag_enum int_flag);

#endif /* GD32H77X_EDIM_ENDAT_H */
